constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          3600;
        startFace       3809160;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21420;
        startFace       3812760;
    }
    outlet
    {
        type            patch;
        nFaces          3600;
        startFace       3834180;
    }
    atmosphere
    {
        type            patch;
        nFaces          21420;
        startFace       3837780;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42840;
        startFace       3859200;
    }
)

// ************************************************************************* //
